=begin
= OpenPNE3プラグインの作り方 (3.1)

== はじめに

OpenPNE3はあらゆる機能をプラグインとして追加することができます。
OpenPNE3はフレームワークとしてsymfonyを利用していますが、OpenPNE3のプラグインはsymfonyのプラグインとは違います。
このドキュメントでは、OpenPNE3プラグインの作成方法を紹介します。

== 前提条件

このドキュメントは、以下の条件がそろっていることを前提とします。

* OpenPNE3.1がインストール・動作する環境がある
* 上の環境においてコンソールでの作業ができる

なお、このチュートリアルを読む前に、symfonyのtutorialである、((<Jobbet for Doctrine|URL:http://www.symfony-project.org/jobeet/1_2/Doctrine/ja/>))で、symfonyの知識を付けることを推奨します。

== プラグインの骨組みの作成

=== タスクの実行

=== モジュールの追加

== データモデル

== フォーム

== アクションとビュー

== セキュリティ

== ガジェット

== テンプレート拡張

== コアのアクションに処理を追加する

== マイグレード

== 管理画面
